herculesp17/matter_light/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# ESP32-C6-DevKitM-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0
# LEDs
CONFIG_BSP_LEDS_NUM=1
CONFIG_BSP_LED_TYPE_RGB=b
CONFIG_BSP_LED_RGB_GPIO=0
CONFIG_BSP_LED_RGB_BACKEND_RMT=y

